app/controllers/artists_controller.rb

  def index
    if params[:song_id]
      @artists = Song.find(params[:author_id]).songs
    else
      @artists = Artist.all
---
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 1]]
SELECT "artists".* FROM "artists"